accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/orders/GetCRMOrderItems-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/RequestManagement/GetCRMOrderItems">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetCRMOrderItemsResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <get:OrderNumber>?</get:OrderNumber>
               <!--Optional:-->
               <get:OrderType>?</get:OrderType>
               <!--Optional:-->
               <get:ServiceAccount>?</get:ServiceAccount>
               <get:ListOfOrderItems>
                  <!--Zero or more repetitions:-->
                  <get:OrderItem>
                     <!--Optional:-->
                     <get:Quantity>?</get:Quantity>
                     <get:ProductName>?</get:ProductName>
                     <!--Optional:-->
                     <get:ActionCode>?</get:ActionCode>
                     <get:CreationDate>?</get:CreationDate>
                     <!--Optional:-->
                     <get:Cost>?</get:Cost>
                     <!--Optional:-->
                     <get:Unit>?</get:Unit>
                     <!--Optional:-->
                     <get:StatusReason>?</get:StatusReason>
                     <get:ListOfOrderItemAttributes>
                        <!--Zero or more repetitions:-->
                        <get:OrderItemAttribute>
                           <get:Name>?</get:Name>
                           <get:Value>?</get:Value>
                        </get:OrderItemAttribute>
                     </get:ListOfOrderItemAttributes>
                     <!--Zero or more repetitions:-->
                     <get:OrderItem>
                        <!--Optional:-->
                        <get:Quantity>?</get:Quantity>
                        <get:ProductName>?</get:ProductName>
                        <!--Optional:-->
                        <get:ActionCode>?</get:ActionCode>
                        <get:CreationDate>?</get:CreationDate>
                        <!--Optional:-->
                        <get:Cost>?</get:Cost>
                        <!--Optional:-->
                        <get:Unit>?</get:Unit>
                        <!--Optional:-->
                        <get:StatusReason>?</get:StatusReason>
                        <get:ListOfOrderItemAttributes>
                           <!--Zero or more repetitions:-->
                           <get:OrderItemAttribute>
                              <get:Name>?</get:Name>
                              <get:Value>?</get:Value>
                           </get:OrderItemAttribute>
                        </get:ListOfOrderItemAttributes>
                     </get:OrderItem>
                  </get:OrderItem>
               </get:ListOfOrderItems>
            </lcew:Body>
         </Response>
      </web:GetCRMOrderItemsResponse>
   </soapenv:Body>
</soapenv:Envelope>